In [1]:
import pandas as pd
import sqlalchemy

In [10]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/shopdb')

In [11]:
df = pd.read_sql_table("customers",engine)

In [12]:
df

   CustomerID CustomerName ContactName Country
0           1     John Doe        John     USA
1           2   Jane Smith        Jane  Canada
2           3   Paul Brown        Paul      UK
3           4        Rohit       Rohit   India

In [15]:
q = '''
    SELECT * FROM shopdb.customers limit 2;
'''
df1 = pd.read_sql_query(q,engine)
df1

   CustomerID CustomerName ContactName Country
0           1     John Doe        John     USA
1           2   Jane Smith        Jane  Canada

In [16]:
df2 = pd.read_csv("customers.csv")
df2

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [18]:
df2.rename(columns={
    "Customer Name":"name",
    "Customer Phone":"phone"
},inplace=True)
df2

              name       phone
0     rafael nadal  4567895647
1  maria sharapova   434534545
2   vladimir putin    89345345
3      kim un jong   123434456
4       jeff bezos   934534543
5     rahul gandhi    44324222

In [ ]:
df.to_sql(name="customers", con=engine, index=False, if_exists="append", method='multi', chunksize=1000)